; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f8-p11-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)

(above f4 f5)
(above f4 f6)
(above f4 f7)

(above f5 f6)
(above f5 f7)

(above f6 f7)



(origin p0 f4)
(destin p0 f5)

(origin p1 f4)
(destin p1 f3)

(origin p2 f4)
(destin p2 f5)

(origin p3 f1)
(destin p3 f4)

(origin p4 f2)
(destin p4 f7)

(origin p5 f3)
(destin p5 f2)

(origin p6 f0)
(destin p6 f3)

(origin p7 f0)
(destin p7 f1)

(origin p8 f6)
(destin p8 f3)

(origin p9 f7)
(destin p9 f6)

(origin p10 f7)
(destin p10 f3)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
))
)

; plan
1. (board f0 p7)
   added: (boarded p7)
   goals met: 0 of 11
2. (board f0 p6)
   added: (boarded p6)
   goals met: 0 of 11
3. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 11
4. (depart f1 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 1 of 11
5. (board f1 p3)
   added: (boarded p3)
   goals met: 1 of 11
6. (up f1 f4)
   deleted: (lift-at f1)
   added: (lift-at f4)
   goals met: 1 of 11
7. (depart f4 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 11
8. (board f4 p2)
   added: (boarded p2)
   goals met: 2 of 11
9. (board f4 p1)
   added: (boarded p1)
   goals met: 2 of 11
10. (board f4 p0)
   added: (boarded p0)
   goals met: 2 of 11
11. (down f4 f2)
   deleted: (lift-at f4)
   added: (lift-at f2)
   goals met: 2 of 11
12. (board f2 p4)
   added: (boarded p4)
   goals met: 2 of 11
13. (up f2 f5)
   deleted: (lift-at f2)
   added: (lift-at f5)
   goals met: 2 of 11
14. (depart f5 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 3 of 11
15. (depart f5 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 4 of 11
16. (up f5 f7)
   deleted: (lift-at f5)
   added: (lift-at f7)
   goals met: 4 of 11
17. (board f7 p10)
   added: (boarded p10)
   goals met: 4 of 11
18. (board f7 p9)
   added: (boarded p9)
   goals met: 4 of 11
19. (depart f7 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 5 of 11
20. (down f7 f6)
   deleted: (lift-at f7)
   added: (lift-at f6)
   goals met: 5 of 11
21. (board f6 p8)
   added: (boarded p8)
   goals met: 5 of 11
22. (depart f6 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 6 of 11
23. (down f6 f3)
   deleted: (lift-at f6)
   added: (lift-at f3)
   goals met: 6 of 11
24. (board f3 p5)
   added: (boarded p5)
   goals met: 6 of 11
25. (depart f3 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 7 of 11
26. (depart f3 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 8 of 11
27. (depart f3 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 9 of 11
28. (depart f3 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 10 of 11
29. (down f3 f2)
   deleted: (lift-at f3)
   added: (lift-at f2)
   goals met: 10 of 11
30. (depart f2 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 11 of 11
